stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u355xx.h
/**
  * @brief FLASH Registers
  */
typedef struct
{
  __IO uint32_t ACR;              /*!< FLASH access control register,                  Address offset: 0x00 */
       uint32_t RESERVED1;        /*!< Reserved,                                       Address offset: 0x04 */
  __IO uint32_t KEYR;             /*!< FLASH non-secure key register,                  Address offset: 0x08 */
  __IO uint32_t SKEYR;            /*!< FLASH secure key register,                      Address offset: 0x0C */
  __IO uint32_t OPTKEYR;          /*!< FLASH option key register,                      Address offset: 0x10 */
       uint32_t RESERVED2;        /*!< Reserved,                                       Address offset: 0x14 */
  __IO uint32_t PDKEY1R;          /*!< FLASH bank 1 power-down key register,           Address offset: 0x18 */
  __IO uint32_t PDKEY2R;          /*!< FLASH bank 2 power-down key register,           Address offset: 0x1C */
  __IO uint32_t SR;               /*!< FLASH non-secure status register,               Address offset: 0x20 */
  __IO uint32_t SSR;              /*!< FLASH secure status register,                   Address offset: 0x24 */
  __IO uint32_t CR;               /*!< FLASH non-secure control register,              Address offset: 0x28 */
  __IO uint32_t SCR;              /*!< FLASH secure control register,                  Address offset: 0x2C */
  __IO uint32_t ECCCR;            /*!< FLASH ECC correction register,                  Address offset: 0x30 */
  __IO uint32_t ECCDR;            /*!< FLASH ECC detection register,                   Address offset: 0x34 */
  __IO uint32_t OPSR;             /*!< FLASH OPSR register,                            Address offset: 0x38 */
       uint32_t RESERVED3;        /*!< Reserved,                                       Address offset: 0x3C */
  __IO uint32_t OPTR;             /*!< FLASH option control register,                  Address offset: 0x40 */
  __IO uint32_t BOOT0R;           /*!< FLASH non-secure boot address 0 register,       Address offset: 0x44 */
  __IO uint32_t BOOT1R;           /*!< FLASH non-secure boot address 1 register,       Address offset: 0x48 */
  __IO uint32_t SBOOT0R;          /*!< FLASH secure boot address 0 register,           Address offset: 0x4C */
  __IO uint32_t SECWM1R1;         /*!< FLASH secure watermark1 register 1,             Address offset: 0x50 */
  __IO uint32_t SECWM1R2;         /*!< FLASH secure watermark1 register 2,             Address offset: 0x54 */
  __IO uint32_t WRP1AR;           /*!< FLASH WRP1 area A address register,             Address offset: 0x58 */
  __IO uint32_t WRP1BR;           /*!< FLASH WRP1 area B address register,             Address offset: 0x5C */
  __IO uint32_t SECWM2R1;         /*!< FLASH secure watermark2 register 1,             Address offset: 0x60 */
  __IO uint32_t SECWM2R2;         /*!< FLASH secure watermark2 register 2,             Address offset: 0x64 */
  __IO uint32_t WRP2AR;           /*!< FLASH WRP2 area A address register,             Address offset: 0x68 */
  __IO uint32_t WRP2BR;           /*!< FLASH WRP2 area B address register,             Address offset: 0x6C */
       uint32_t RESERVED4[4];     /*!< Reserved,                                       Address offset: 0x70-0x7C */
  __IO uint32_t SECBB1R1;         /*!< FLASH secure block-based bank 1 register 1,     Address offset: 0x80 */
  __IO uint32_t SECBB1R2;         /*!< FLASH secure block-based bank 1 register 2,     Address offset: 0x84 */
  __IO uint32_t SECBB1R3;         /*!< FLASH secure block-based bank 1 register 3,     Address offset: 0x88 */
  __IO uint32_t SECBB1R4;         /*!< FLASH secure block-based bank 1 register 4,     Address offset: 0x8C */
       uint32_t RESERVED5[4];     /*!< Reserved,                                       Address offset: 0x90-0x9C */
  __IO uint32_t SECBB2R1;         /*!< FLASH secure block-based bank 2 register 1,     Address offset: 0xA0 */
  __IO uint32_t SECBB2R2;         /*!< FLASH secure block-based bank 2 register 2,     Address offset: 0xA4 */
  __IO uint32_t SECBB2R3;         /*!< FLASH secure block-based bank 2 register 3,     Address offset: 0xA8 */
  __IO uint32_t SECBB2R4;         /*!< FLASH secure block-based bank 2 register 4,     Address offset: 0xAC */
       uint32_t RESERVED6[4];     /*!< Reserved,                                       Address offset: 0xB0-0xBC */
  __IO uint32_t SECHDPCR;         /*!< FLASH secure HDP control register,              Address offset: 0xC0 */
  __IO uint32_t PRIVCFGR;         /*!< FLASH privilege configuration register,         Address offset: 0xC4 */
  __IO uint32_t SECHDPEXTR;       /*!< FLASH HDP extension register,                   Address offset: 0xC8 */
       uint32_t RESERVED7;        /*!< Reserved,                                       Address offset: 0xCC */
  __IO uint32_t PRIVBB1R1;        /*!< FLASH privilege block-based bank 1 register 1,  Address offset: 0xD0 */
  __IO uint32_t PRIVBB1R2;        /*!< FLASH privilege block-based bank 1 register 2,  Address offset: 0xD4 */
  __IO uint32_t PRIVBB1R3;        /*!< FLASH privilege block-based bank 1 register 3,  Address offset: 0xD8 */
  __IO uint32_t PRIVBB1R4;        /*!< FLASH privilege block-based bank 1 register 4,  Address offset: 0xDC */
       uint32_t RESERVED8[4];     /*!< Reserved,                                       Address offset: 0xE0-0xEC */
  __IO uint32_t PRIVBB2R1;        /*!< FLASH privilege block-based bank 2 register 1,  Address offset: 0xF0 */
  __IO uint32_t PRIVBB2R2;        /*!< FLASH privilege block-based bank 2 register 2,  Address offset: 0xF4 */
  __IO uint32_t PRIVBB2R3;        /*!< FLASH privilege block-based bank 2 register 3,  Address offset: 0xF8 */
  __IO uint32_t PRIVBB2R4;        /*!< FLASH privilege block-based bank 2 register 4,  Address offset: 0xFC */
       uint32_t RESERVED9[4];     /*!< Reserved,                                       Address offset: 0x100-0x10C */
  __IO uint32_t OEM1KEYR1;        /*!< FLASH OEM1 key register 1,                      Address offset: 0x110 */
  __IO uint32_t OEM1KEYR2;        /*!< FLASH OEM1 key register 2,                      Address offset: 0x114 */
  __IO uint32_t OEM1KEYR3;        /*!< FLASH OEM1 key register 3,                      Address offset: 0x118 */
  __IO uint32_t OEM1KEYR4;        /*!< FLASH OEM1 key register 4,                      Address offset: 0x11C */
  __IO uint32_t OEM2KEYR1;        /*!< FLASH OEM2 key register 1,                      Address offset: 0x120 */
  __IO uint32_t OEM2KEYR2;        /*!< FLASH OEM2 key register 2,                      Address offset: 0x124 */
  __IO uint32_t OEM2KEYR3;        /*!< FLASH OEM2 key register 3,                      Address offset: 0x128 */
  __IO uint32_t OEM2KEYR4;        /*!< FLASH OEM2 key register 4,                      Address offset: 0x12C */
  __IO uint32_t OEMKEYSR;         /*!< FLASH OEM key status register,                  Address offset: 0x130 */
} FLASH_TypeDef;

/**
  * @brief General Purpose I/O
  */
typedef struct
{
  __IO uint32_t MODER;            /*!< GPIO port mode register,               Address offset: 0x00      */
  __IO uint32_t OTYPER;           /*!< GPIO port output type register,        Address offset: 0x04      */
  __IO uint32_t OSPEEDR;          /*!< GPIO port output speed register,       Address offset: 0x08      */
  __IO uint32_t PUPDR;            /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
  __IO uint32_t IDR;              /*!< GPIO port input data register,         Address offset: 0x10      */
  __IO uint32_t ODR;              /*!< GPIO port output data register,        Address offset: 0x14      */
  __IO uint32_t BSRR;             /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
  __IO uint32_t LCKR;             /*!< GPIO port configuration lock register, Address offset: 0x1C      */
  __IO uint32_t AFR[2];           /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
  __IO uint32_t BRR;              /*!< GPIO Bit Reset register,               Address offset: 0x28      */
  __IO uint32_t HSLVR;            /*!< GPIO high-speed low voltage register,  Address offset: 0x2C      */
  __IO uint32_t SECCFGR;          /*!< GPIO secure configuration register,    Address offset: 0x30      */
} GPIO_TypeDef;

typedef struct
{
  __IO uint32_t IER1;             /*!< TZIC interrupt enable register 1, Address offset: 0x00 */
  __IO uint32_t IER2;             /*!< TZIC interrupt enable register 2, Address offset: 0x04 */
  __IO uint32_t IER3;             /*!< TZIC interrupt enable register 3, Address offset: 0x08 */
  __IO uint32_t IER4;             /*!< TZIC interrupt enable register 4, Address offset: 0x0C */
  __IO uint32_t SR1;              /*!< TZIC status register 1,           Address offset: 0x10 */
  __IO uint32_t SR2;              /*!< TZIC status register 2,           Address offset: 0x14 */
  __IO uint32_t SR3;              /*!< TZIC status register 3,           Address offset: 0x18 */
  __IO uint32_t SR4;              /*!< TZIC status register 4,           Address offset: 0x1C */
  __IO uint32_t FCR1;             /*!< TZIC flag clear register 1,       Address offset: 0x20 */
  __IO uint32_t FCR2;             /*!< TZIC flag clear register 2,       Address offset: 0x24 */
  __IO uint32_t FCR3;             /*!< TZIC flag clear register 3,       Address offset: 0x28 */
  __IO uint32_t FCR4;             /*!< TZIC flag clear register 3,       Address offset: 0x2C */
} GTZC_TZIC_TypeDef;

typedef struct
{
  __IO uint32_t CR;               /*!< MPCBBx control register,                  Address offset: 0x00        */
  uint32_t RESERVED1[3];          /*!< Reserved1,                                Address offset: 0x04-0x0C   */
  __IO uint32_t CFGLOCKR1;        /*!< MPCBBx Configuration lock register,       Address offset: 0x10        */
  uint32_t RESERVED2[59];         /*!< Reserved2,                                Address offset: 0x14-0xFC   */
  __IO uint32_t SECCFGR[12];      /*!< MPCBBx security configuration registers,  Address offset: 0x100-0x12C */
  uint32_t RESERVED3[52];         /*!< Reserved3,                                Address offset: 0x130-0x200 */
  __IO uint32_t PRIVCFGR[12];     /*!< MPCBBx privilege configuration registers, Address offset: 0x200-0x22C */
} GTZC_MPCBB_TypeDef;

/**
  * @brief Global TrustZone Controller
  */
typedef struct
{
  __IO uint32_t CR;               /*!< TZSC control register,                                                Address offset: 0x00      */
       uint32_t RESERVED1[3];     /*!< Reserved1,                                                            Address offset: 0x04-0x0C */
  __IO uint32_t SECCFGR1;         /*!< TZSC secure configuration register 1,                                 Address offset: 0x10      */
  __IO uint32_t SECCFGR2;         /*!< TZSC secure configuration register 2,                                 Address offset: 0x14      */
  __IO uint32_t SECCFGR3;         /*!< TZSC secure configuration register 3,                                 Address offset: 0x18      */
       uint32_t RESERVED2;        /*!< Reserved2,                                                            Address offset: 0x1C      */
  __IO uint32_t PRIVCFGR1;        /*!< TZSC privilege configuration register 1,                              Address offset: 0x20      */
  __IO uint32_t PRIVCFGR2;        /*!< TZSC privilege configuration register 2,                              Address offset: 0x24      */
  __IO uint32_t PRIVCFGR3;        /*!< TZSC privilege configuration register 3,                              Address offset: 0x28      */
} GTZC_TZSC_TypeDef;

/**
  * @brief HASH
  */
typedef struct
{
  __IO uint32_t CR;               /*!< HASH control register,          Address offset: 0x00        */
  __IO uint32_t DIN;              /*!< HASH data input register,       Address offset: 0x04        */
  __IO uint32_t STR;              /*!< HASH start register,            Address offset: 0x08        */
  __IO uint32_t HR[5];            /*!< HASH digest registers,          Address offset: 0x0C-0x1C   */
  __IO uint32_t IMR;              /*!< HASH interrupt enable register, Address offset: 0x20        */
  __IO uint32_t SR;               /*!< HASH status register,           Address offset: 0x24        */
  __IO uint32_t SHA3CFGR;         /*!< HASH SHA-3 configuration register,  Address offset: 0x28    */
       uint32_t RESERVED[51];     /*!< Reserved, 0x2C-0xF4                                         */
  __IO uint32_t CSR[103];         /*!< HASH context swap registers,    Address offset: 0x0F8-0x290 */
} HASH_TypeDef;

/**
  * @brief HASH_DIGEST
  */
typedef struct
{
  __IO uint32_t HR[50];           /*!< HASH digest registers,          Address offset: 0x310-0x3D4 */
} HASH_DIGEST_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< I2C Control register 1,                  Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< I2C Control register 2,                  Address offset: 0x04 */
  __IO uint32_t OAR1;             /*!< I2C Own address 1 register,              Address offset: 0x08 */
  __IO uint32_t OAR2;             /*!< I2C Own address 2 register,              Address offset: 0x0C */
  __IO uint32_t TIMINGR;          /*!< I2C Timing register,                     Address offset: 0x10 */
  __IO uint32_t TIMEOUTR;         /*!< I2C Timeout register,                    Address offset: 0x14 */
  __IO uint32_t ISR;              /*!< I2C Interrupt and status register,       Address offset: 0x18 */
  __IO uint32_t ICR;              /*!< I2C Interrupt clear register,            Address offset: 0x1C */
  __IO uint32_t PECR;             /*!< I2C PEC register,                        Address offset: 0x20 */
  __IO uint32_t RXDR;             /*!< I2C Receive data register,               Address offset: 0x24 */
  __IO uint32_t TXDR;             /*!< I2C Transmit data register,              Address offset: 0x28 */
  __IO uint32_t AUTOCR;           /*!< I2C Autonomous mode control register,    Address offset: 0x2C */
} I2C_TypeDef;

/**
  * @brief Improved Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR;             /*!< I3C Control register,                      Address offset: 0x00      */
  __IO uint32_t CFGR;           /*!< I3C Controller Configuration register,     Address offset: 0x04      */
  uint32_t      RESERVED1[2];   /*!< Reserved,                                  Address offset: 0x08-0x0C */
  __IO uint32_t RDR;            /*!< I3C Received Data register,                Address offset: 0x10      */
  __IO uint32_t RDWR;           /*!< I3C Received Data Word register,           Address offset: 0x14      */
  __IO uint32_t TDR;            /*!< I3C Transmit Data register,                Address offset: 0x18      */
  __IO uint32_t TDWR;           /*!< I3C Transmit Data Word register,           Address offset: 0x1C      */
  __IO uint32_t IBIDR;          /*!< I3C IBI payload Data register,             Address offset: 0x20      */
  __IO uint32_t TGTTDR;         /*!< I3C Target Transmit register,              Address offset: 0x24      */
  uint32_t      RESERVED2[2];   /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IO uint32_t SR;             /*!< I3C Status register,                       Address offset: 0x30      */
  __IO uint32_t SER;            /*!< I3C Status Error register,                 Address offset: 0x34      */
  uint32_t      RESERVED3[2];   /*!< Reserved,                                  Address offset: 0x38-0x3C */
  __IO uint32_t RMR;            /*!< I3C Received Message register,             Address offset: 0x40      */
  uint32_t      RESERVED4[3];   /*!< Reserved,                                  Address offset: 0x44-0x4C */
  __IO uint32_t EVR;            /*!< I3C Event register,                        Address offset: 0x50      */
  __IO uint32_t IER;            /*!< I3C Interrupt Enable register,             Address offset: 0x54      */
  __IO uint32_t CEVR;           /*!< I3C Clear Event register,                  Address offset: 0x58      */
  __IO uint32_t MISR;           /*!< I3C Masked Interrupt Status register,      Address offset: 0x5C      */
  __IO uint32_t DEVR0;          /*!< I3C own Target characteristics register,   Address offset: 0x60      */
  __IO uint32_t DEVRX[4];       /*!< I3C Target x (1<=x<=4) register,           Address offset: 0x64-0x70 */
  uint32_t      RESERVED6[7];   /*!< Reserved,                                  Address offset: 0x74-0x8C */
  __IO uint32_t MAXRLR;         /*!< I3C Maximum Read Length register,          Address offset: 0x90      */
  __IO uint32_t MAXWLR;         /*!< I3C Maximum Write Length register,         Address offset: 0x94      */
  uint32_t      RESERVED7[2];   /*!< Reserved,                                  Address offset: 0x98-0x9C */
  __IO uint32_t TIMINGR0;       /*!< I3C Timing 0 register,                     Address offset: 0xA0      */
  __IO uint32_t TIMINGR1;       /*!< I3C Timing 1 register,                     Address offset: 0xA4      */
  __IO uint32_t TIMINGR2;       /*!< I3C Timing 2 register,                     Address offset: 0xA8      */
  uint32_t      RESERVED9[5];   /*!< Reserved,                                  Address offset: 0xAC-0xBC */
  __IO uint32_t BCR;            /*!< I3C Bus Characteristics register,          Address offset: 0xC0      */
  __IO uint32_t DCR;            /*!< I3C Device Characteristics register,       Address offset: 0xC4      */
  __IO uint32_t GETCAPR;        /*!< I3C GET CAPabilities register,             Address offset: 0xC8      */
  __IO uint32_t CRCAPR;         /*!< I3C Controller CAPabilities register,      Address offset: 0xCC      */
  __IO uint32_t GETMXDSR;       /*!< I3C GET Max Data Speed register,           Address offset: 0xD0      */
  __IO uint32_t EPIDR;          /*!< I3C Extended Provisioned ID register,      Address offset: 0xD4      */
} I3C_TypeDef;

/**
  * @brief Instruction Cache
  */
typedef struct
{
  __IO uint32_t CR;               /*!< ICACHE control register,                Address offset: 0x00 */
  __IO uint32_t SR;               /*!< ICACHE status register,                 Address offset: 0x04 */
  __IO uint32_t IER;              /*!< ICACHE interrupt enable register,       Address offset: 0x08 */
  __IO uint32_t FCR;              /*!< ICACHE Flag clear register,             Address offset: 0x0C */
  __IO uint32_t HMONR;            /*!< ICACHE hit monitor register,            Address offset: 0x10 */
  __IO uint32_t MMONR;            /*!< ICACHE miss monitor register,           Address offset: 0x14 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                        0x018-0x01C */
  __IO uint32_t CRR0;             /*!< ICACHE region 0 configuration register, Address offset: 0x20 */
  __IO uint32_t CRR1;             /*!< ICACHE region 1 configuration register, Address offset: 0x24 */
  __IO uint32_t CRR2;             /*!< ICACHE region 2 configuration register, Address offset: 0x28 */
  __IO uint32_t CRR3;             /*!< ICACHE region 3 configuration register, Address offset: 0x2C */
} ICACHE_TypeDef;

/**
  * @brief IWDG
  */
typedef struct
{
  __IO uint32_t KR;               /*!< IWDG Key register,          Address offset: 0x00 */
  __IO uint32_t PR;               /*!< IWDG Prescaler register,    Address offset: 0x04 */
  __IO uint32_t RLR;              /*!< IWDG Reload register,       Address offset: 0x08 */
  __IO uint32_t SR;               /*!< IWDG Status register,       Address offset: 0x0C */
  __IO uint32_t WINR;             /*!< IWDG Window register,       Address offset: 0x10 */
  __IO uint32_t EWCR;             /*!< IWDG Early Wakeup register, Address offset: 0x14 */
} IWDG_TypeDef;


/**
  * @brief LPTIMER
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< LPTIM Interrupt and Status register,    Address offset: 0x00 */
  __IO uint32_t ICR;              /*!< LPTIM Interrupt Clear register,         Address offset: 0x04 */
  __IO uint32_t DIER;             /*!< LPTIM Interrupt Enable register,        Address offset: 0x08 */
  __IO uint32_t CFGR;             /*!< LPTIM Configuration register,           Address offset: 0x0C */
  __IO uint32_t CR;               /*!< LPTIM Control register,                 Address offset: 0x10 */
  __IO uint32_t CCR1;             /*!< LPTIM Capture/Compare register 1,       Address offset: 0x14 */
  __IO uint32_t ARR;              /*!< LPTIM Autoreload register,              Address offset: 0x18 */
  __IO uint32_t CNT;              /*!< LPTIM Counter register,                 Address offset: 0x1C */
  __IO uint32_t RESERVED0;        /*!< Reserved,                               Address offset: 0x20 */
  __IO uint32_t CFGR2;            /*!< LPTIM Configuration register 2,         Address offset: 0x24 */
  __IO uint32_t RCR;              /*!< LPTIM Repetition register,              Address offset: 0x28 */
  __IO uint32_t CCMR1;            /*!< LPTIM Capture/Compare mode register,    Address offset: 0x2C */
  __IO uint32_t RESERVED1;        /*!< Reserved,                               Address offset: 0x30 */
  __IO uint32_t CCR2;             /*!< LPTIM Capture/Compare register 2,       Address offset: 0x34 */
} LPTIM_TypeDef;

/**
  * @brief MDF/ADF
  */
typedef struct
{
  __IO uint32_t GCR;              /*!< MDF Global Control register,            Address offset: 0x00  */
  __IO uint32_t CKGCR;            /*!< MDF Clock Generator Control Register,   Address offset: 0x04  */
 uint32_t       RESERVED0[6];     /*!< Reserved, 0x08-0x1C                                           */
  __IO uint32_t TRGISELR;         /*!< MDF Trigger Input Selection Register,   Address offset: 0x20  */
} MDF_TypeDef;

/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;            /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;            /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;            /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;          /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;          /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 uint32_t      RESERVED0[4];      /*!< Reserved, 0x94-0xA0                                                  */
 __IO uint32_t DLYCR;             /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 uint32_t      RESERVED1[1];      /*!< Reserved, 0xA8                                                       */
 __IO uint32_t DFLTIER;           /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;           /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 uint32_t      RESERVED2[1];      /*!< Reserved, 0xB4                                                       */
 __IO uint32_t SADCR;             /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;           /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;          /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;          /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t      RESERVED3[10];     /*!< Reserved, 0xC8-0xEC                                                  */
 __IO uint32_t DFLTDR;            /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

