stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u355xx.h
typedef  XSPIM_TypeDef OCTOSPIM_TypeDef;

/*@}*/ /* end of group STM32U3xx_peripherals */

/* --------  End of section using anonymous unions and disabling warnings  -------- */
#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* ================================================================================================================== */
/* ================                     Device Specific Peripheral Address Map                       ================ */
/* ================================================================================================================== */
/** @addtogroup STM32U3xx_Peripheral_peripheralAddr
  * @{
  */

/*!< Flash, Peripheral and internal SRAMs base addresses - Non secure */
#define FLASH_BASE_NS                   0x08000000UL  /*!< FLASH non-secure base address        */
#define SYSTEM_FLASH_BASE_NS            0x0BF80000UL  /*!< System FLASH non-secure base address */
#define SRAM1_BASE_NS                   0x20000000UL  /*!< SRAM1 non-secure base address        */
#define SRAM2_BASE_NS                   0x20030000UL  /*!< SRAM2 non-secure base address        */

#define PERIPH_BASE_NS                  0x40000000UL  /*!< Peripheral non-secure base address   */
#define EXTRAM_BASE_NS                  0x90000000UL  /*!< External RAM base address            */
#define EPPB_BASE                       0xE0040000UL  /*!< External Private Peripheral Bus      */

/*!< OTP, Engineering bytes, Option bytes defines */
#define FLASH_OTP_BASE                  (SYSTEM_FLASH_BASE_NS + 0x00020000UL) /*!< FLASH OTP (one-time programmable) base address */
#define FLASH_OTP_SIZE                  0x00000200U                           /*!< 512 bytes OTP (one-time programmable)          */
#define FLASH_ENGY_BASE                 (SYSTEM_FLASH_BASE_NS + 0x00020500UL)
#define PACKAGE_BASE                    (FLASH_ENGY_BASE)                     /*!< Package data register base address     */
#define UID_BASE                        (FLASH_ENGY_BASE + 0x00000200UL)      /*!< Unique device ID register base address */
#define FLASHSIZE_BASE                  (FLASH_ENGY_BASE + 0x000002A0UL)      /*!< Flash size data register base address  */
#define UID64_BASE                      (FLASH_ENGY_BASE + 0x00000500UL)      /*!< 64-bit Unique device Identification    */

/*!< Memory sizes */
/* Internal Flash size */
#define FLASH_SIZE                      ((((*((uint16_t *)FLASHSIZE_BASE)) == 0xFFFFU)) ? 0x80000U : \
                                         ((((*((uint16_t *)FLASHSIZE_BASE)) == 0x0000U)) ? 0x80000U : \
                                           (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0xFFFFU)) << 10U)))

/*!< Internal SRAMs size */
#define SRAM1_SIZE                      0x00020000UL  /*!< SRAM1=128k */
#define SRAM2_SIZE                      0x00010000UL  /*!< SRAM2=64k  */

/*!< Peripheral memory map - Non secure */
#define APB1PERIPH_BASE_NS              PERIPH_BASE_NS
#define APB2PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00010000UL)
#define AHB1PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00020000UL)
#define APB3PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00040000UL)
#define AHB2PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x02020000UL)

/*!< APB1 Non secure peripherals */
#define TIM2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00000000UL)
#define TIM3_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00000400UL)
#define TIM4_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00000800UL)
#define TIM6_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00001000UL)
#define TIM7_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00001400UL)
#define SPI3_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00002000UL)
#define WWDG_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00002C00UL)
#define IWDG_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00003000UL)
#define SPI2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00003800UL)
#define USART3_BASE_NS                  (APB1PERIPH_BASE_NS + 0x00004800UL)
#define UART4_BASE_NS                   (APB1PERIPH_BASE_NS + 0x00004C00UL)
#define UART5_BASE_NS                   (APB1PERIPH_BASE_NS + 0x00005000UL)
#define I2C1_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00005400UL)
#define I3C1_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00005C00UL)
#define CRS_BASE_NS                     (APB1PERIPH_BASE_NS + 0x00006000UL)
#define OPAMP1_BASE_NS                  (APB1PERIPH_BASE_NS + 0x00007000UL)
#define OPAMP2_BASE_NS                  (OPAMP1_BASE_NS + 0x0000010UL)
#define VREFBUF_BASE_NS                 (APB1PERIPH_BASE_NS + 0x00007400UL)
#define RTC_BASE_NS                     (APB1PERIPH_BASE_NS + 0x00007800UL)
#define TAMP_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00007C00UL)
#define LPTIM2_BASE_NS                  (APB1PERIPH_BASE_NS + 0x00009400UL)

/*!< APB2 Non secure peripherals */
#define TIM1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00002C00UL)
#define SPI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00003000UL)
#define USART1_BASE_NS                  (APB2PERIPH_BASE_NS + 0x00003800UL)
#define TIM15_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004000UL)
#define TIM16_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004400UL)
#define TIM17_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004800UL)
#define USB_DRD_BASE_NS                 (APB2PERIPH_BASE_NS + 0x00006000UL)
#define USB_DRD_PMAADDR_NS              (APB2PERIPH_BASE_NS + 0x00006400UL)

